#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:[0m
[0m[33mhttps://app.terraform.io/app/tianlu-terraform-org/news-search/runs/run-oMP2THgPEALFLeMz[0m
[0m
Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.google_container_engine_versions.gke_version: Reading...[0m[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform planned the following actions, but then encountered a problem:

[1m  # google_compute_network.vpc[0m will be created
[0m  [32m+[0m[0m resource "google_compute_network" "vpc" {
      [32m+[0m[0m auto_create_subnetworks                   = false
      [32m+[0m[0m delete_default_routes_on_create           = false
      [32m+[0m[0m gateway_ipv4                              = (known after apply)
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m internal_ipv6_range                       = (known after apply)
      [32m+[0m[0m mtu                                       = (known after apply)
      [32m+[0m[0m name                                      = "impactful-drive-450613-q8-vpc"
      [32m+[0m[0m network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      [32m+[0m[0m project                                   = (known after apply)
      [32m+[0m[0m routing_mode                              = (known after apply)
      [32m+[0m[0m self_link                                 = (known after apply)
    }

[1m  # google_compute_subnetwork.subnet[0m will be created
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "subnet" {
      [32m+[0m[0m creation_timestamp         = (known after apply)
      [32m+[0m[0m external_ipv6_prefix       = (known after apply)
      [32m+[0m[0m fingerprint                = (known after apply)
      [32m+[0m[0m gateway_address            = (known after apply)
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ip_cidr_range              = "10.10.0.0/24"
      [32m+[0m[0m ipv6_cidr_range            = (known after apply)
      [32m+[0m[0m name                       = "impactful-drive-450613-q8-subnet"
      [32m+[0m[0m network                    = "impactful-drive-450613-q8-vpc"
      [32m+[0m[0m private_ip_google_access   = (known after apply)
      [32m+[0m[0m private_ipv6_google_access = (known after apply)
      [32m+[0m[0m project                    = (known after apply)
      [32m+[0m[0m purpose                    = (known after apply)
      [32m+[0m[0m region                     = "europe-west4"
      [32m+[0m[0m secondary_ip_range         = (known after apply)
      [32m+[0m[0m self_link                  = (known after apply)
      [32m+[0m[0m stack_type                 = (known after apply)
    }

[1m  # google_container_cluster.primary[0m will be created
[0m  [32m+[0m[0m resource "google_container_cluster" "primary" {
      [32m+[0m[0m cluster_ipv4_cidr           = (known after apply)
      [32m+[0m[0m datapath_provider           = (known after apply)
      [32m+[0m[0m default_max_pods_per_node   = (known after apply)
      [32m+[0m[0m enable_binary_authorization = false
      [32m+[0m[0m enable_intranode_visibility = (known after apply)
      [32m+[0m[0m enable_kubernetes_alpha     = false
      [32m+[0m[0m enable_l4_ilb_subsetting    = false
      [32m+[0m[0m enable_legacy_abac          = false
      [32m+[0m[0m enable_shielded_nodes       = true
      [32m+[0m[0m endpoint                    = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m initial_node_count          = 1
      [32m+[0m[0m label_fingerprint           = (known after apply)
      [32m+[0m[0m location                    = "europe-west4-b"
      [32m+[0m[0m logging_service             = (known after apply)
      [32m+[0m[0m master_version              = (known after apply)
      [32m+[0m[0m monitoring_service          = (known after apply)
      [32m+[0m[0m name                        = "impactful-drive-450613-q8-gke"
      [32m+[0m[0m network                     = "impactful-drive-450613-q8-vpc"
      [32m+[0m[0m networking_mode             = (known after apply)
      [32m+[0m[0m node_locations              = (known after apply)
      [32m+[0m[0m node_version                = (known after apply)
      [32m+[0m[0m operation                   = (known after apply)
      [32m+[0m[0m private_ipv6_google_access  = (known after apply)
      [32m+[0m[0m project                     = (known after apply)
      [32m+[0m[0m remove_default_node_pool    = true
      [32m+[0m[0m self_link                   = (known after apply)
      [32m+[0m[0m services_ipv4_cidr          = (known after apply)
      [32m+[0m[0m subnetwork                  = "impactful-drive-450613-q8-subnet"
      [32m+[0m[0m tpu_ipv4_cidr_block         = (known after apply)

      [32m+[0m[0m addons_config (known after apply)

      [32m+[0m[0m authenticator_groups_config (known after apply)

      [32m+[0m[0m cluster_autoscaling (known after apply)

      [32m+[0m[0m confidential_nodes (known after apply)

      [32m+[0m[0m cost_management_config (known after apply)

      [32m+[0m[0m database_encryption (known after apply)

      [32m+[0m[0m default_snat_status (known after apply)

      [32m+[0m[0m gateway_api_config (known after apply)

      [32m+[0m[0m ip_allocation_policy (known after apply)

      [32m+[0m[0m logging_config (known after apply)

      [32m+[0m[0m master_auth (known after apply)

      [32m+[0m[0m master_authorized_networks_config (known after apply)

      [32m+[0m[0m mesh_certificates (known after apply)

      [32m+[0m[0m monitoring_config (known after apply)

      [32m+[0m[0m node_config (known after apply)

      [32m+[0m[0m node_pool (known after apply)

      [32m+[0m[0m node_pool_defaults (known after apply)

      [32m+[0m[0m notification_config (known after apply)

      [32m+[0m[0m release_channel (known after apply)

      [32m+[0m[0m security_posture_config (known after apply)

      [32m+[0m[0m service_external_ips_config (known after apply)

      [32m+[0m[0m vertical_pod_autoscaling (known after apply)

      [32m+[0m[0m workload_identity_config (known after apply)
    }

[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m kubernetes_cluster_host = (known after apply)
  [32m+[0m[0m kubernetes_cluster_name = "impactful-drive-450613-q8-gke"
  [32m+[0m[0m project_id              = "impactful-drive-450613-q8"
  [32m+[0m[0m region                  = "europe-west4"
[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mError retrieving available container cluster versions: Get "https://container.googleapis.com/v1/projects/impactful-drive-450613-q8/locations/europe-west4-b/serverConfig?alt=json&prettyPrint=false": oauth2/google: status code 403: {
[31m│[0m [0m  "error": {
[31m│[0m [0m    "code": 403,
[31m│[0m [0m    "message": "Permission 'iam.serviceAccounts.getAccessToken' denied on resource (or it may not exist).",
[31m│[0m [0m    "status": "PERMISSION_DENIED",
[31m│[0m [0m    "details": [
[31m│[0m [0m      {
[31m│[0m [0m        "@type": "type.googleapis.com/google.rpc.ErrorInfo",
[31m│[0m [0m        "reason": "IAM_PERMISSION_DENIED",
[31m│[0m [0m        "domain": "iam.googleapis.com",
[31m│[0m [0m        "metadata": {
[31m│[0m [0m          "permission": "iam.serviceAccounts.getAccessToken"
[31m│[0m [0m        }
[31m│[0m [0m      }
[31m│[0m [0m    ]
[31m│[0m [0m  }
[31m│[0m [0m}
[31m│[0m [0m[0m
[31m│[0m [0m
[31m│[0m [0m[0m  with data.google_container_engine_versions.gke_version,
[31m│[0m [0m  on gke.tf line 18, in data "google_container_engine_versions" "gke_version":
[31m│[0m [0m  18: data "google_container_engine_versions" "gke_version" [4m{[0m[0m
[31m│[0m [0m
[31m╵[0m[0m
Operation failed: failed running terraform plan (exit 1)

```

</details>

*Pusher: @tianshuailu, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*